Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult
The results of TS-Bim Model data product compatibility check.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult.Status
The compatibility status between Tekla Structures and Bim Model data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult.Metadata
Metadata of the Bim Model data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult.#ctor(Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus,Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductMetadata)
The results of TS-Bim Model data product compatibility check.
status: How compatible is TS with the data product
metadata: Metadata of Bim Model data product